In [144]:
# librerias necesarias
import pandas as pd
import numpy as np

In [145]:
df_features = pd.read_csv('features_dataset.csv')
df_sales = pd.read_csv('sales_dataset.csv')
df_stores = pd.read_csv('stores_dataset.csv')

In [146]:
df_sales.head()

   Store  Dept        Date  Weekly_Sales  IsHoliday
0      1     1  05/02/2010      24924.50      False
1      1     1  12/02/2010      46039.49       True
2      1     1  19/02/2010      41595.55      False
3      1     1  26/02/2010      19403.54      False
4      1     1  05/03/2010      21827.90      False

In [147]:
df_features.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8190 entries, 0 to 8189
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Store         8190 non-null   int64
 1   Date          8190 non-null   object
 2   Temperature   8190 non-null   float64
 3   Fuel_Price    8190 non-null   float64
 4   MarkDown1     4032 non-null   float64
 5   MarkDown2     2921 non-null   float64
 6   MarkDown3     3613 non-null   float64
 7   MarkDown4     3464 non-null   float64
 8   MarkDown5     4050 non-null   float64
 9   CPI           7605 non-null   float64
 10  Unemployment  7605 non-null   float64
 11  IsHoliday     8190 non-null   bool
dtypes: bool(1), float64(9), int64(1), object(1)
memory usage: 712.0+ KB

In [148]:
df_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 421570 entries, 0 to 421569
Data columns (total 5 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   Store         421570 non-null  int64
 1   Dept          421570 non-null  int64
 2   Date          421570 non-null  object
 3   Weekly_Sales  421570 non-null  float64
 4   IsHoliday     421570 non-null  bool
dtypes: bool(1), float64(1), int64(2), object(1)
memory usage: 13.3+ MB

In [149]:
df_stores.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45 entries, 0 to 44
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Store   45 non-null     int64
 1   Type    45 non-null     object
 2   Size    45 non-null     int64
dtypes: int64(2), object(1)
memory usage: 1.2+ KB

In [150]:
df_features.head(3)

,Store,Date,Temperature,Fuel_Price,MarkDown1,MarkDown2,MarkDown3,MarkDown4,MarkDown5,CPI,Unemployment,IsHoliday
0,1,05/02/2010,42.31,2.572,NaN,NaN,NaN,NaN,NaN,211.096358,8.106,False
1,1,12/02/2010,38.51,2.548,NaN,NaN,NaN,NaN,NaN,211.242170,8.106,True
2,1,19/02/2010,39.93,2.514,NaN,NaN,NaN,NaN,NaN,211.289143,8.106,False

In [151]:
df_sales.head(3)

   Store  Dept        Date  Weekly_Sales  IsHoliday
0      1     1  05/02/2010      24924.50      False
1      1     1  12/02/2010      46039.49       True
2      1     1  19/02/2010      41595.55      False

In [152]:
df_stores.head(3)

   Store Type    Size
0      1    A  151315
1      2    A  202307
2      3    B   37392

In [153]:
# copias de cada df
df_features_1 = df_features.copy()
df_sales_1 = df_sales.copy()
df_stores_1 = df_stores.copy()

In [154]:
#set store como indice de los df
df_features_1.set_index('Store', inplace=True)

In [155]:
df_sales_1.set_index('Store', inplace=True)
df_stores_1.set_index('Store', inplace=True)

In [156]:
# union entre el data frame de features y el de stores
df_features_store = df_features_1.join(df_stores_1)
df_features_store.head(2)

,Date,Temperature,Fuel_Price,MarkDown1,MarkDown2,MarkDown3,MarkDown4,MarkDown5,CPI,Unemployment,IsHoliday,Type,Size
Store,,,,,,,,,,,,,
1,05/02/2010,42.31,2.572,NaN,NaN,NaN,NaN,NaN,211.096358,8.106,False,A,151315
1,12/02/2010,38.51,2.548,NaN,NaN,NaN,NaN,NaN,211.242170,8.106,True,A,151315

In [157]:
columns_df_fs = df_features_store.columns.to_list()
print(columns_df_fs)

['Date', 'Temperature', 'Fuel_Price', 'MarkDown1', 'MarkDown2', 'MarkDown3', 'MarkDown4', 'MarkDown5', 'CPI', 'Unemployment', 'IsHoliday', 'Type', 'Size']

In [158]:
df_sales_1.head(2)

       Dept        Date  Weekly_Sales  IsHoliday
Store
1         1  05/02/2010      24924.50      False
1         1  12/02/2010      46039.49       True

In [159]:
df_sales_store.shape

(421570, 6)

In [160]:
df_sales_store = df_sales_1.join(df_stores_1)
df_sales_store.reset_index(inplace=True)

In [161]:
df_sales_store.shape

(421570, 7)

In [162]:
df_fs_sales.head()

,Date_fs,IsHoliday_fs,Type,Dept,Date_sales,Weekly_Sales,IsHoliday_sales
Store,,,,,,,
1,05/02/2010,False,A,1,05/02/2010,24924.50,False
1,05/02/2010,False,A,1,12/02/2010,46039.49,True
1,05/02/2010,False,A,1,19/02/2010,41595.55,False
1,05/02/2010,False,A,1,26/02/2010,19403.54,False
1,05/02/2010,False,A,1,05/03/2010,21827.90,False

In [163]:
print(df_sales_store.columns.to_list())

['Store', 'Dept', 'Date', 'Weekly_Sales', 'IsHoliday', 'Type', 'Size']

In [164]:
df_sales_store = df_sales_store[['Store', 'Type', 'Dept', 'Weekly_Sales', 'Date', 'IsHoliday']]

In [165]:
df_sales_store.head()

   Store Type  Dept  Weekly_Sales        Date  IsHoliday
0      1    A     1      24924.50  05/02/2010      False
1      1    A     1      46039.49  12/02/2010       True
2      1    A     1      41595.55  19/02/2010      False
3      1    A     1      19403.54  26/02/2010      False
4      1    A     1      21827.90  05/03/2010      False

(8190, 3)